## 📋 Terraform Plan Summary

| Path | Result | Change Detail |
| :--- | :---: | :--- |
| `environments/test1` | ⚠️ | +1 add, -1 destroy |
| `environments/test2` | ⚠️ | +2 add |


<details><summary><strong>Show Detailed Plans</strong></summary>

### 📂 `environments/test1`
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.main.null_resource.default will be created
  + resource "null_resource" "default" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = "9e70f615d228dfbc"
          + "name" = "test1"
        }
    }

  # module.main.null_resource.main will be destroyed
  # (because null_resource.main is not in configuration)
  - resource "null_resource" "main" {
      - id       = "5811220108638201812" -> null
      - triggers = {
          - "id"   = "9e70f615d228dfbc"
          - "name" = "test1"
        } -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

### 📂 `environments/test2`
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.main will be created
  + resource "random_id" "main" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.main.null_resource.default will be created
  + resource "null_resource" "default" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = (known after apply)
          + "name" = "test2"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + result = {}

```

</details>